backend/app/controllers/posts_controller.rb

  def create
    puts params[:event][:id]

    post = Post.create(id: params[:event][:permalink], post: params[:event])
---
INSERT INTO "posts" ("id", "post", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def show
  puts params
  post = Post.find_by_id(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]